# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [3]:
# 記得先 Import 正確的套件

'''
Your Code
'''
import pandas as pd
import numpy as np

In [12]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [13]:
df.priority.map({"yes":'True', "no":'False'})

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: object

In [14]:
'''
Your Code
'''
# - 計算每個不同種類 animal 的 age 的平均數
df.groupby('animal').mean()
# - 計算每個不同種類 animal 的 age 的平均數
# - 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
df.sort_values(by=['age', 'visits'])
# - 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
df['priority'] = df.priority.map({"yes":'True', "no":'False'})
df

  animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  NaN       3     True
e    dog  5.0       2    False
f    cat  2.0       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [15]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.458122  0.368018  0.610631
1  0.607377  0.798913  0.864841
2  0.039041  0.300979  0.281196
3  0.491057  0.156899  0.174550
4  0.448029  0.556891  0.980821

In [27]:
'''
Your Code
'''
print(df.mean(axis=0))
df1 = df.sub(df.mean(axis=0))
df1

0    0.408725
1    0.436340
2    0.582408
dtype: float64

          0         1         2
0  0.049397 -0.068322  0.028223
1  0.198652  0.362573  0.282433
2 -0.369685 -0.135361 -0.301212
3  0.082332 -0.279441 -0.407858
4  0.039304  0.120551  0.398414

In [25]:
'''
Your Code
'''
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.020802 -0.110906  0.131707
1 -0.149666  0.041869  0.107797
2 -0.168031  0.093907  0.074124
3  0.216889 -0.117270 -0.099619
4 -0.213885 -0.105022  0.318908

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [30]:
df.sum().argmin()

0

In [32]:
'''
Your Code
'''
df.sum(axis=0).argmin()

0

In [31]:
'''
Your Code
'''
df.sum(axis=1).argmin()

2